package ch03;

import java.math.*;

import java.util.*;

/**
 * This program uses big numbers to compute the odds of winning the grand prize in a lottery.
 * @version 1.20 2004-02-10
 * @author Cay Horstmann
 */
public class BigIntegerTest
{
   public static void main(String[] args)
   {
      Scanner in = new Scanner(System.in);

      System.out.print("숫자 몇개 뽑을 겁니까? :  ");  // 10
      int k = in.nextInt();

      System.out.print("뽑는 최대값은 얼마 입니까? ");  // 999
      int n = in.nextInt();

      /*
       * compute binomial coefficient n*(n-1)*(n-2)*...*(n-k+1)/(1*2*3*...*k)
       * (x + 1)(x + 1) = (1*x^2 + 2*x + 1)*(1*x^2 + 2*x + 1)
       * 				= 1 3 3 1
       */

      BigInteger lotteryOdds = BigInteger.valueOf(1);
      BigDecimal salary = new BigDecimal("260775464857350510704076260775464"
      		+ "8573505107040762607754648573505107040762607754648573505107040"
      		+ "762607754648573505107040762607754648573505107040762607754648573"
      		+ "50510704076260775464857350510704076260775464857350510704076260775"
      		+ "4648573505107040762607754648573505107040762607754648573505107040762"
      		+ "607754648573505107040762607754648573505107040762607754648573505107040"
      		+ "7626077546485735051070407626077546485735051070407626077546485735051070"
      		+ "407626077546485735051070407626077546485735051070407626077546485735051070"
      		+ "40762607754648573505107040762607754648573505107040762607754648573505107040"
      		+ "76260775464857350510704076260775464857350510704076260775464857350510704076260"
      		+ "77546485735051070407626077546485735051070407626077546485735051070407626077546485"
      		+ "7350510704076260775464857350510704076260775464857350510704076260775464857350510704"
      		+ "076260775464857350510704076260775464857350510704076");
    
      for (int i = 1; i <= k; i++)
         lotteryOdds = lotteryOdds.multiply(BigInteger.valueOf(n - i + 1)).divide(
            BigInteger.valueOf(i));

      System.out.printf("당첨확율은 %d 분의 1 임다.\n", lotteryOdds);
   }
}
